[{"data":1,"prerenderedAt":656},["Reactive",2],{"content-/blog/hci/comp4621-3rd, params":3,"content-query-mrPl0bY3tc":378},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"_empty":6,"title":8,"description":9,"author":10,"dates":11,"body":13,"_type":373,"_id":374,"_source":375,"_file":376,"_extension":377},"/blog/hci/comp4621-3rd","hci",false,"","Group project 3 - Social VR Cultural World","Diary for COMP4621 Project 3","@Leung King Suen, Oscar",{"published":12},"04-05-2022",{"type":14,"children":15,"toc":362},"root",[16,25,31,36,41,46,52,57,66,75,83,88,93,103,108,113,121,126,131,141,146,156,161,166,172,182,187,192,198,203,221,226,231,236,241,247,257,262,272,277,282,288,298,303,313,318,323,329,334,339,344,349,356],{"type":17,"tag":18,"props":19,"children":21},"element","h2",{"id":20},"ideation",[22],{"type":23,"value":24},"text","Ideation",{"type":17,"tag":26,"props":27,"children":28},"p",{},[29],{"type":23,"value":30},"Upon reading the project instruction PDF, Me and our groupmates have a very vague idea on actually what we are going to implement. Because the scope is very large for VR applications. After reading and watching some user scenario like mozilla hub and VRChat. I get some idea on what the project prototype may look like.",{"type":17,"tag":26,"props":32,"children":33},{},[34],{"type":23,"value":35},"Our initial idea were really normal. Like some sports game, simple games inside it. Karaoke, watching films, concerting together, some other things also includes window shopping in a VR world. However, these idea don't have any charateristics inside it, it is also quite boring, that is, there not a theme.",{"type":17,"tag":26,"props":37,"children":38},{},[39],{"type":23,"value":40},"Moreover, if we want to make things more complicated, let's say making a hide and seek game, or Among us style game inside our VR world. However, the functions provided by mozilla hub is really limited. I later found that mozilla hub isn't for game at all, people were saying it as a alternative to zoom, or zoom class. While another VR software VRChat is more game orientated. But we all thought that way the project will be too complicated, we are time limited and therefore don't have the time to continue on that",{"type":17,"tag":26,"props":42,"children":43},{},[44],{"type":23,"value":45},"Then someone mention that, how about we make a language learning theme. It as like people will be gathering inside the VR world, and they will chat with each other using different languages. It will be a perfect scenario where language-learners can get themseleves into the atmosphere. Later we also decide to boarden the the scope a bit. Make it tourist/museum like theme. And because of this is a international theme, we just want to put international famous heritage around the world, and in the centre it will be a flat piazza for people to gather and chat. It also acts as a centre point for us. It will be a outdoor theme, since I think these years people can't go out to travel because of COVID, and making ourdoor theme will be better.",{"type":17,"tag":18,"props":47,"children":49},{"id":48},"finding-base-map",[50],{"type":23,"value":51},"Finding base map",{"type":17,"tag":26,"props":53,"children":54},{},[55],{"type":23,"value":56},"then we decided to find base map and start building it in the spoke. I had to say spoke interface are kind of user friendly. But later it will become a disater because of this. As we don't want to stuck with old maps, so we need to find a new map, and it has to be beautiful.",{"type":17,"tag":26,"props":58,"children":59},{},[60],{"type":17,"tag":61,"props":62,"children":65},"img",{"alt":63,"src":64},"Sample Map 1","/img/4621_3/p31.jpg",[],{"type":17,"tag":67,"props":68,"children":73},"figcaption",{"className":69},[70,71,72],"text-center","italic","font-medium",[74],{"type":23,"value":63},{"type":17,"tag":26,"props":76,"children":77},{},[78],{"type":17,"tag":61,"props":79,"children":82},{"alt":80,"src":81},"Sample Map 2","/img/4621_3/p32.jpg",[],{"type":17,"tag":67,"props":84,"children":86},{"className":85},[70,71,72],[87],{"type":23,"value":80},{"type":17,"tag":26,"props":89,"children":90},{},[91],{"type":23,"value":92},"We found some really good map on Sketchfab. They are really good looking and nice. Some of them are scanned or hand-built, but at the end they are really high definition. Some maps are not in .glb format originally, so it can't be loaded into spoke directly. But download it first and then convert it into .glb in blender solve the problem.",{"type":17,"tag":26,"props":94,"children":95},{},[96,98],{"type":23,"value":97},"But when we try to export maps into mozilla hubs to test its size and texture, spoke isn't happy about it. Until now, I get to know that, spoke generates collision and walkable planes using two different techniques. Normally the walking plane is generated using trimesh. Trimesh provides a high definition walking plane, And user can walk up slope, uneven terrain. So every plane are made of triangles. However, although this method works fine in small indoor map. For such a big complex outdoor terrain map, it is too complicated for spoke to generate such terrain. and often it will throw out error such as 'error generating nav mesh'. And we always find it hard to upload onto mozilla hub.\r\n",{"type":17,"tag":61,"props":99,"children":102},{"alt":100,"src":101},"Setting trimesh","/img/4621_3/p33.jpg",[],{"type":17,"tag":67,"props":104,"children":106},{"className":105},[70,71,72],[107],{"type":23,"value":100},{"type":17,"tag":26,"props":109,"children":110},{},[111],{"type":23,"value":112},"You can see the 'force trimesh' box in this picture. Normally spoke will be using trimesh and 2d plane at the same time. Force trimesh is well, as stated.",{"type":17,"tag":26,"props":114,"children":115},{},[116],{"type":17,"tag":61,"props":117,"children":120},{"alt":118,"src":119},"Mesh Plan and Glitching","/img/4621_3/p34.jpg",[],{"type":17,"tag":67,"props":122,"children":124},{"className":123},[70,71,72],[125],{"type":23,"value":118},{"type":17,"tag":26,"props":127,"children":128},{},[129],{"type":23,"value":130},"The second method is called 2d plane. So it can only create planes that are different height. mostly slopes are ignored. So the user can't walk on terrain. And it is very confusing to have somewhere you can't walk. It't like meeting a airwall in a game. You can see the floor plan meseed up on slopes, and for stonhenge it's another mess. It means that the user can'walk inside the stonhenge, and walk up the slope.",{"type":17,"tag":26,"props":132,"children":133},{},[134,136],{"type":23,"value":135},"So at the end, we settled on the default terrain map, we added a flat plane on it, so it would be flat. And we can place objects on it without making to much of adjustment to the objects.\r\n",{"type":17,"tag":61,"props":137,"children":140},{"alt":138,"src":139},"The Overview","/img/4621_3/p35.jpg",[],{"type":17,"tag":67,"props":142,"children":144},{"className":143},[70,71,72],[145],{"type":23,"value":138},{"type":17,"tag":26,"props":147,"children":148},{},[149,151],{"type":23,"value":150},"This is the end product that ends up in the demo video. The grey flat plane is what I mentioned. And we added objects to the plane. Moreover, clouds like sphere were also added. Also the 'simple' water object was placed to make the titanic looks like sinking into the water.\r\n",{"type":17,"tag":61,"props":152,"children":155},{"alt":153,"src":154},"The Titanic","/img/4621_3/p36.jpg",[],{"type":17,"tag":67,"props":157,"children":159},{"className":158},[70,71,72],[160],{"type":23,"value":153},{"type":17,"tag":26,"props":162,"children":163},{},[164],{"type":23,"value":165},"You may already figured out. We want to make a scene in the Titanic film. And it would be fun to get a feeling of standing at the end of the ship, to feel what that height feels.",{"type":17,"tag":18,"props":167,"children":169},{"id":168},"processing-models",[170],{"type":23,"value":171},"Processing Models",{"type":17,"tag":26,"props":173,"children":174},{},[175,177],{"type":23,"value":176},"We took some models on Sketchfab to be our heritage objects. But there are some models that are either hand-made or scanned using photogrammerty. We had a Fumishimi Castle in our map, which that model was originally scanned into a 3D object.\r\n",{"type":17,"tag":61,"props":178,"children":181},{"alt":179,"src":180},"Previewing model in Blender","/img/4621_3/p37.jpg",[],{"type":17,"tag":67,"props":183,"children":185},{"className":184},[70,71,72],[186],{"type":23,"value":179},{"type":17,"tag":26,"props":188,"children":189},{},[190],{"type":23,"value":191},"The original model is even larger than this, it is as if it's the whole scenery in there. But we need to trim it down as a smaller object. The reason is, a small history lesson first. The japanese castle were designed so high, and have a base that are multi stories is that, they can be higher when someone trys to attack the castle. But it means that the floor plan generation and collision handling will be very hard for us. So we need to trim down the model in blender first, make it 'simpler'.",{"type":17,"tag":18,"props":193,"children":195},{"id":194},"battling-the-128mb-limit",[196],{"type":23,"value":197},"Battling the 128MB limit",{"type":17,"tag":26,"props":199,"children":200},{},[201],{"type":23,"value":202},"Somewhere into our peoject, after we placed some of the objects into the the world. And we found that it cannot be compiled. The reason simply is, mozilla hub only supports a world up to 128MB!!!!! That means we need to shrink some sizes of the objects!! For example, a stonehenge will take approx. 37MB. a fushimi castle took up 32MB. There's really not much of the space left.",{"type":17,"tag":26,"props":204,"children":205},{},[206,208,214,216],{"type":23,"value":207},"So what we done, is to reduce the texture size. The original texture in Fushimi Castle in 8K, which is 8192",{"type":17,"tag":209,"props":210,"children":211},"em",{},[212],{"type":23,"value":213},"8192. We reduces its size to 2048",{"type":23,"value":215},"2048 in photoshop. And that castle only takes up 15MB now!\r\n",{"type":17,"tag":61,"props":217,"children":220},{"alt":218,"src":219},"Inspecting image size","/img/4621_3/p38.jpg",[],{"type":17,"tag":67,"props":222,"children":224},{"className":223},[70,71,72],[225],{"type":23,"value":218},{"type":17,"tag":26,"props":227,"children":228},{},[229],{"type":23,"value":230},"We also changes the stonehenge to a simple one. Instead of the very high definition stonehenge you saw in m=my previous shot. The new stonhenge is rather simple, low poly. And it doesn't even have textures. So we need to paint it in brown in blender. The new stonehenge now only eats up 1MB of size!",{"type":17,"tag":26,"props":232,"children":233},{},[234],{"type":23,"value":235},"Our final product eats up 127MB of size. This is really the most extreme size we can take. one more simple object would exceeds the size limit and ruin the whole thing!",{"type":17,"tag":26,"props":237,"children":238},{},[239],{"type":23,"value":240},"Small reflection->I can imagine in the future I will be working with limited resources..I guess it's better to save resources for later use at first, so when later optimizing the size, it would be alot easier to shrink its sizes.",{"type":17,"tag":18,"props":242,"children":244},{"id":243},"games-implementation",[245],{"type":23,"value":246},"Games implementation",{"type":17,"tag":26,"props":248,"children":249},{},[250,252],{"type":23,"value":251},"As I said, we want to implement games inside the mozilla hub. But it is function limited. I tried make a basketball field inside it, but playing with it was rather boring. Primarily because of the hitbox are wrong, and controlling, moving things inside the hub is very hard.\r\n",{"type":17,"tag":61,"props":253,"children":256},{"alt":254,"src":255},"Basketball Game","/img/4621_3/p39.jpg",[],{"type":17,"tag":67,"props":258,"children":260},{"className":259},[70,71,72],[261],{"type":23,"value":254},{"type":17,"tag":26,"props":263,"children":264},{},[265,267],{"type":23,"value":266},"So a guy suggest that, why we make some local traditional games around the world. That sounds interesting, And relatively easy to implement, also fits our culture exchange theme.\r\n",{"type":17,"tag":61,"props":268,"children":271},{"alt":269,"src":270},"Mini-Games","/img/4621_3/p310.jpg",[],{"type":17,"tag":67,"props":273,"children":275},{"className":274},[70,71,72],[276],{"type":23,"value":269},{"type":17,"tag":26,"props":278,"children":279},{},[280],{"type":23,"value":281},"I searched some local games on web. And these traditional games are all mainly boardgames, so it's really easy to implement. and we use duck+chicken to be our chess. The fron two games are Kaooa from India and another strategy game from South Korea. The 3 games behind that are 3 different three in a row games from 3 different countries. Though If I have time I would change the texture of the chicken. because that chicken is in white color, while game map is also in white, it will be maybe a little bit hard to distinguish.",{"type":17,"tag":18,"props":283,"children":285},{"id":284},"demovideo",[286],{"type":23,"value":287},"DemoVideo",{"type":17,"tag":26,"props":289,"children":290},{},[291,293],{"type":23,"value":292},"I get to create Demo video for the project. I get the idea from a discontinued programme by TVB. It's called the Earth Live (瞬間看地球), and it has been discontinued in the April the 1st. It's really sad lo...\r\n",{"type":17,"tag":61,"props":294,"children":297},{"alt":295,"src":296},"Earth Live","/img/4621_3/p311.jpg",[],{"type":17,"tag":67,"props":299,"children":301},{"className":300},[70,71,72],[302],{"type":23,"value":295},{"type":17,"tag":26,"props":304,"children":305},{},[306,308],{"type":23,"value":307},"The programme is just a live camera around the world. But I think that is a small part of collective memories of Hong Kong. So I want to mimic the programme, by using the same UIs and Musics from it.\r\n",{"type":17,"tag":61,"props":309,"children":312},{"alt":310,"src":311},"Editing the Demo video","/img/4621_3/p312.jpg",[],{"type":17,"tag":67,"props":314,"children":316},{"className":315},[70,71,72],[317],{"type":23,"value":310},{"type":17,"tag":26,"props":319,"children":320},{},[321],{"type":23,"value":322},"You can see I photoshoped the UI into the video. And that UI acted as a title also for each part of the demo. In the demo I introduced and demo-ed many concepts in thie world, such as timetable feture, it's like, I don't know someone who's reading this have played GTAv before, on the online server, there will be random event every 5-10 minutes or so. And player will be motivated to paticipate in such event, so the online game play will be more interesting. It is the same idea in our world, but a little different. Just the events are talks/shars/tours/games, they are more 'educational' I would say. Because if you get into the world without anything todo, it would be rather boring. It also have souvenir exchange feature, which I see it as a good way to enhance exchange among players.",{"type":17,"tag":18,"props":324,"children":326},{"id":325},"end-credits",[327],{"type":23,"value":328},"End Credits",{"type":17,"tag":26,"props":330,"children":331},{},[332],{"type":23,"value":333},"Till the end of this project. To be honest, I personally think the whole map can be better, as well as the lighting. I asked a friend which I do needfinding and surverying about the final product, he's also the guy who gives me initial idea on making a tourists spot map first. He said the map looks like a 3D game from the early 2000s. Where I can't agreed anymore. Because I later realized the lighting in mozilla hub is really for indoor lighting. I can imagine other group using directional lighting to make a colorful pub out of this.",{"type":17,"tag":26,"props":335,"children":336},{},[337],{"type":23,"value":338},"More so, I with the size limit in the mozilla hub can be larger, Like at least 256MB of 200MB. Then we can put more building in the map to fill blanks, so the whole world will be prettier. and the objects will be more high definition, and you can really walk under the stonehenge to feel what is like under the great rocks.",{"type":17,"tag":26,"props":340,"children":341},{},[342],{"type":23,"value":343},"But anyway, I think the idea is what our project really shines. Because when we are thinking this project, the normal ideas, like concert, karaoke and video watching is really old-school, and there are many alternatives now, like Discord. Think if you are a user, why would I use this instead of discord? Same goes for the games idea, why won't I just play human fall flat? Why I don't just play animal crossing or other sports games? When you start thinking this, you will realize there are really too much good product now, and it is really meaningless to make a bad replication of those.",{"type":17,"tag":26,"props":345,"children":346},{},[347],{"type":23,"value":348},"But, there's no such culture/language exchange world right now, yes? Since people can't go our to travel due to travel restriction of COVID, people don't have the chance to talk to others right? Then why won't us make people meet in the virtual world? Oh yeah! Not to mention We have a souvenir feature, which allows players to exchange souvenirs that are a icon of its country with others! That's really the point, the highlight of our project, and that's what differs ours to other normal VR world. It will be a world with interactive, fruitful events.",{"type":17,"tag":26,"props":350,"children":351},{},[352],{"type":17,"tag":61,"props":353,"children":355},{"alt":7,"src":354},"/img/4621_3/p313.jpg",[],{"type":17,"tag":67,"props":357,"children":359},{"className":358},[70,71,72],[360],{"type":23,"value":361},"Gift Exchange",{"title":7,"searchDepth":363,"depth":363,"links":364},3,[365,367,368,369,370,371,372],{"id":20,"depth":366,"text":24},2,{"id":48,"depth":366,"text":51},{"id":168,"depth":366,"text":171},{"id":194,"depth":366,"text":197},{"id":243,"depth":366,"text":246},{"id":284,"depth":366,"text":287},{"id":325,"depth":366,"text":328},"markdown","content:blog:hci:comp4621-3rd.md","content","blog/hci/comp4621-3rd.md","md",{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"_empty":6,"title":8,"description":9,"author":10,"dates":379,"body":380,"_type":373,"_id":374,"_source":375,"_file":376,"_extension":377},{"published":12},{"type":14,"children":381,"toc":647},[382,386,390,394,398,402,406,410,416,421,427,432,436,443,448,452,458,463,467,474,479,486,491,495,499,506,511,515,519,523,535,540,544,548,552,556,563,568,575,580,584,588,595,600,607,612,616,620,624,628,632,636,642],{"type":17,"tag":18,"props":383,"children":384},{"id":20},[385],{"type":23,"value":24},{"type":17,"tag":26,"props":387,"children":388},{},[389],{"type":23,"value":30},{"type":17,"tag":26,"props":391,"children":392},{},[393],{"type":23,"value":35},{"type":17,"tag":26,"props":395,"children":396},{},[397],{"type":23,"value":40},{"type":17,"tag":26,"props":399,"children":400},{},[401],{"type":23,"value":45},{"type":17,"tag":18,"props":403,"children":404},{"id":48},[405],{"type":23,"value":51},{"type":17,"tag":26,"props":407,"children":408},{},[409],{"type":23,"value":56},{"type":17,"tag":26,"props":411,"children":412},{},[413],{"type":17,"tag":61,"props":414,"children":415},{"alt":63,"src":64},[],{"type":17,"tag":67,"props":417,"children":419},{"className":418},[70,71,72],[420],{"type":23,"value":63},{"type":17,"tag":26,"props":422,"children":423},{},[424],{"type":17,"tag":61,"props":425,"children":426},{"alt":80,"src":81},[],{"type":17,"tag":67,"props":428,"children":430},{"className":429},[70,71,72],[431],{"type":23,"value":80},{"type":17,"tag":26,"props":433,"children":434},{},[435],{"type":23,"value":92},{"type":17,"tag":26,"props":437,"children":438},{},[439,440],{"type":23,"value":97},{"type":17,"tag":61,"props":441,"children":442},{"alt":100,"src":101},[],{"type":17,"tag":67,"props":444,"children":446},{"className":445},[70,71,72],[447],{"type":23,"value":100},{"type":17,"tag":26,"props":449,"children":450},{},[451],{"type":23,"value":112},{"type":17,"tag":26,"props":453,"children":454},{},[455],{"type":17,"tag":61,"props":456,"children":457},{"alt":118,"src":119},[],{"type":17,"tag":67,"props":459,"children":461},{"className":460},[70,71,72],[462],{"type":23,"value":118},{"type":17,"tag":26,"props":464,"children":465},{},[466],{"type":23,"value":130},{"type":17,"tag":26,"props":468,"children":469},{},[470,471],{"type":23,"value":135},{"type":17,"tag":61,"props":472,"children":473},{"alt":138,"src":139},[],{"type":17,"tag":67,"props":475,"children":477},{"className":476},[70,71,72],[478],{"type":23,"value":138},{"type":17,"tag":26,"props":480,"children":481},{},[482,483],{"type":23,"value":150},{"type":17,"tag":61,"props":484,"children":485},{"alt":153,"src":154},[],{"type":17,"tag":67,"props":487,"children":489},{"className":488},[70,71,72],[490],{"type":23,"value":153},{"type":17,"tag":26,"props":492,"children":493},{},[494],{"type":23,"value":165},{"type":17,"tag":18,"props":496,"children":497},{"id":168},[498],{"type":23,"value":171},{"type":17,"tag":26,"props":500,"children":501},{},[502,503],{"type":23,"value":176},{"type":17,"tag":61,"props":504,"children":505},{"alt":179,"src":180},[],{"type":17,"tag":67,"props":507,"children":509},{"className":508},[70,71,72],[510],{"type":23,"value":179},{"type":17,"tag":26,"props":512,"children":513},{},[514],{"type":23,"value":191},{"type":17,"tag":18,"props":516,"children":517},{"id":194},[518],{"type":23,"value":197},{"type":17,"tag":26,"props":520,"children":521},{},[522],{"type":23,"value":202},{"type":17,"tag":26,"props":524,"children":525},{},[526,527,531,532],{"type":23,"value":207},{"type":17,"tag":209,"props":528,"children":529},{},[530],{"type":23,"value":213},{"type":23,"value":215},{"type":17,"tag":61,"props":533,"children":534},{"alt":218,"src":219},[],{"type":17,"tag":67,"props":536,"children":538},{"className":537},[70,71,72],[539],{"type":23,"value":218},{"type":17,"tag":26,"props":541,"children":542},{},[543],{"type":23,"value":230},{"type":17,"tag":26,"props":545,"children":546},{},[547],{"type":23,"value":235},{"type":17,"tag":26,"props":549,"children":550},{},[551],{"type":23,"value":240},{"type":17,"tag":18,"props":553,"children":554},{"id":243},[555],{"type":23,"value":246},{"type":17,"tag":26,"props":557,"children":558},{},[559,560],{"type":23,"value":251},{"type":17,"tag":61,"props":561,"children":562},{"alt":254,"src":255},[],{"type":17,"tag":67,"props":564,"children":566},{"className":565},[70,71,72],[567],{"type":23,"value":254},{"type":17,"tag":26,"props":569,"children":570},{},[571,572],{"type":23,"value":266},{"type":17,"tag":61,"props":573,"children":574},{"alt":269,"src":270},[],{"type":17,"tag":67,"props":576,"children":578},{"className":577},[70,71,72],[579],{"type":23,"value":269},{"type":17,"tag":26,"props":581,"children":582},{},[583],{"type":23,"value":281},{"type":17,"tag":18,"props":585,"children":586},{"id":284},[587],{"type":23,"value":287},{"type":17,"tag":26,"props":589,"children":590},{},[591,592],{"type":23,"value":292},{"type":17,"tag":61,"props":593,"children":594},{"alt":295,"src":296},[],{"type":17,"tag":67,"props":596,"children":598},{"className":597},[70,71,72],[599],{"type":23,"value":295},{"type":17,"tag":26,"props":601,"children":602},{},[603,604],{"type":23,"value":307},{"type":17,"tag":61,"props":605,"children":606},{"alt":310,"src":311},[],{"type":17,"tag":67,"props":608,"children":610},{"className":609},[70,71,72],[611],{"type":23,"value":310},{"type":17,"tag":26,"props":613,"children":614},{},[615],{"type":23,"value":322},{"type":17,"tag":18,"props":617,"children":618},{"id":325},[619],{"type":23,"value":328},{"type":17,"tag":26,"props":621,"children":622},{},[623],{"type":23,"value":333},{"type":17,"tag":26,"props":625,"children":626},{},[627],{"type":23,"value":338},{"type":17,"tag":26,"props":629,"children":630},{},[631],{"type":23,"value":343},{"type":17,"tag":26,"props":633,"children":634},{},[635],{"type":23,"value":348},{"type":17,"tag":26,"props":637,"children":638},{},[639],{"type":17,"tag":61,"props":640,"children":641},{"alt":7,"src":354},[],{"type":17,"tag":67,"props":643,"children":645},{"className":644},[70,71,72],[646],{"type":23,"value":361},{"title":7,"searchDepth":363,"depth":363,"links":648},[649,650,651,652,653,654,655],{"id":20,"depth":366,"text":24},{"id":48,"depth":366,"text":51},{"id":168,"depth":366,"text":171},{"id":194,"depth":366,"text":197},{"id":243,"depth":366,"text":246},{"id":284,"depth":366,"text":287},{"id":325,"depth":366,"text":328},1690986705826]